#+TITLE: JSON : The sexp of now()
#+PROPERTY: header-args:sql :engine postgres :cmdline "\"host=db.ecm.lan port=5432 user=maxclaims dbname=maxclaims\""

* Row to json array

In the webapp we use [[https://datatables.net/manual/ajax#Loading-data][DataTables]] to make most tables much more
interactive.

Trying to make it as simple as possible means little to no
configuration and trivially hacked to be different.

#+begin_quote
The corresponding initialisation of DataTables for the three data
structures is shown on the right.

1) Array of data - note that the array option does not require the
   columns.data option to be set. This is because the default value
   for columns.data is the column index (i.e. 0, 1, 2...):

[
    "Tiger Nixon",
    "System Architect",
    "$320,800",
    "2011/04/25",
    "Edinburgh",
    "5421"
]

$('#myTable').DataTable( {
    ajax: ...
} );
 
// or!
 
$('#myTable').DataTable( {
    ajax: ...,
    columns: [
        { data: 0 },
        { data: 1 },
        { data: 2 },
        { data: 3 },
        { data: 4 }
    ]
} );
#+end_quote

So we want to turn a row into a json array.

#+begin_src sql
  CREATE OR REPLACE FUNCTION row_to_json_array(record)
  RETURNS JSON LANGUAGE PLPGSQL IMMUTABLE AS $$
  DECLARE
   res json;
  BEGIN
    SELECT json_agg(value) INTO res FROM (SELECT (json_each(row_to_json($1))).value) jk;
    return res;
  END;
  $$;	 
#+end_src

#+begin_src sql
drop function if exists json_sub_array(json, int, int);
create or replace function json_sub_array(_json_array json, from_pos int, to_pos int)
returns json language sql as $$
    select json_agg(value)
    from json_array_elements(_json_array) with ordinality
    where ordinality-1 between from_pos and to_pos
$$;

drop function if exists json_sub_array(json, int);
create or replace function json_sub_array(_json_array json, from_pos int)
returns json language sql as $$
    select json_sub_array(_json_array, from_pos, json_array_length(_json_array));
$$;

drop function if exists jsonb_sub_array(jsonb, int, int);
create or replace function jsonb_sub_array(jsonb_array jsonb, from_pos int, to_pos int)
returns jsonb language sql as $$
    select jsonb_agg(value)
    from jsonb_array_elements(jsonb_array) with ordinality
    where ordinality-1 between from_pos and to_pos;
$$;

drop function if exists jsonb_sub_array(jsonb, int);
create or replace function jsonb_sub_array(jsonb_array jsonb, from_pos int)
returns jsonb language sql as $$
    select jsonb_sub_array(jsonb_array, from_pos, jsonb_array_length(jsonb_array));
$$;
#+end_src

#+RESULTS:
| CREATE FUNCTION |
|-----------------|


* Misc
#+PROPERTY: header-args:sql :engine postgres :cmdline "\"host=ecm.maxwellclaims.net port=5432 user=maxclaims dbname=maxclaims\""
#+begin_src sql
create function jsonb_row_defaults(
  p_table   text,
  p_schema  text DEFAULT 'public'
) returns jsonb
as $$
declare
  t_defaults  jsonb;
  t_value     jsonb;
  t_column    text;
  t_default   text;
begin
  t_defaults := '{}'::jsonb;

  for t_column, t_default in
    select column_name, column_default
    from information_schema.columns
    where
      table_schema=p_schema and
      table_name=p_table
  loop
    if t_default is not null then
      execute 'select to_jsonb(' || t_default || ')' into t_value;
      t_defaults := jsonb_set(t_defaults, array[t_column], t_value);
    end if;
  end loop;

  return t_defaults;
end;
$$ language plpgsql;
#+end_src

#+RESULTS:
| CREATE FUNCTION |
|-----------------|
